# линейный поиск

def linear_search(lst, target):
    for index, value in enumerate(lst):
        if value == target:
            return f'Элемент найден, его индекс: {index}'
    return "Элемент не найден!"


surnames = ['Иванов', 'Петров', 'Сидоров', "Жуков", "Климов"]
print(linear_search(surnames, 'Жуков'))
print(linear_search(surnames, 'Панов'))


def bubble_sort(lst):
    n = len(lst)  # Сколько всего элементов в списке
    for i in range(n - 1):  # Сколько раз нужно пройти по списку
        for j in range(n - 1 - i):  # Сравниваем соседние элементы
            if lst[j] > lst[j + 1]:  # Если элемент больше следующего
                lst[j], lst[j + 1] = lst[j + 1], lst[j]  # Меняем их местами
    return lst


numbers = [64, 34, 25, 12, 22, 11, 90]
#         [34, 64, 25, 12, 22, 11, 90]
#         [34, 25, 64, 12, 22, 11, 90]
#         [34, 25, 12, 64, 22, 11, 90]
#         [34, 25, 12, 22, 64, 11, 90]
#         [34, 25, 12, 22, 11, 64, 90]

#         [25, 34, 12, 22, 11, 64, 90]
#         [25, 12, 34, 22, 11, 64, 90]
#         [25, 12, 22, 34, 11, 64, 90]
#         [25, 12, 22, 11, 34, 64, 90]

#         [12, 25, 22, 11, 34, 64, 90]
#         [12, 22, 25, 11, 34, 64, 90]
#         [12, 22, 11, 25, 34, 64, 90]

#         [12, 11, 22, 25, 34, 64, 90]
#         [12, 11, 22, 25, 34, 64, 90]

#         [11, 12, 22, 25, 34, 64, 90]

print(bubble_sort(numbers))
