# Приветственное сообщение
greeting = "Hello, world!"
# Задание многострочной строки
multiline_string = """Это многострочная строка
которая может переносится 
на несколько строк."""
print(greeting)
print(multiline_string)  # Вывод многострочной строки на экран
