"""
ValueError: Ошибка возникает, когда функция ожидает определенного типа или значения,
но получает что-то неподходящее.
"""
# number = int("hello")  # Невозможно преобразовать строку в число

"""
ZeroDivisionError: Попытка деления на ноль.
"""
# result = 10 / 0

"""
FileNotFoundError: Попытка открыть несуществующий файл.
"""
# file = open("nonexistent_file.txt")

"""
IndexError: Обращение к элементу списка за пределами его длины.
"""
# my_list = [1, 2, 3]
# #          0  1  2
# #         -3 -2 -1
# print(my_list[4])

"""
TypeError: Попытка выполнить операцию с объектом неподходящего типа.
"""
# result = "text" + 5  # Нельзя складывать строку и число